Super0415/My-TEST-STM32F103/12/工程模板_LED/USER/main.c
#include "stm32f10x.h"
#include "ALLApp.h"

#define choose_LED    1    //1-有效   删除无效
//#define choose_Beel   1   
//#define choose_Systick   1
//#define choose_Button   1
//#define choose_NVIC   1
//#define choose_TIM   1
//#define choose_PWM   1
//#define choose_USART232  1
//#define choose_USART485  1
//#define choose_Printf 1
int main(void)
{
#ifdef 	choose_LED
  LEDInit();
#endif

#ifdef  choose_Beel
  BeelInit();
#endif
#ifdef  choose_Systick	
	LEDInit();
	RCC_HSE_Configuration();    //注意试验现象，自定义配置不同，产生延时效果不同    //注释此行时，采用默认配置及72MHz/8=9MHz  
#endif	
#ifdef  choose_Button		
	ButtonInit();
#endif	
#ifdef  choose_NVIC	
    exti_NVIC_Init();		//按键外部中断初始化
	LEDInit();    //需要LED显示现象
#endif	
#ifdef  choose_TIM	
    Tim_Init();	          //定时器中断初始化
	LEDInit();    //需要LED显示现象	
#endif	
#ifdef  choose_PWM	
    PWM_Init();//PWM初始化
#endif	
#ifdef  choose_USART232
    USART232_Init();
#endif
#ifdef  choose_USART485
    USART485_Init();
#endif
#ifdef  choose_Printf
	int age = 24;
	float num = 3.1415926;
    Printf_Init();
#endif
  while(1)
  {
#ifdef 	choose_LED	  
      led_display(); //led显示 
#endif	  
	  
#ifdef  choose_Beel	  
	  //Beel_display();   //选择编译
      Beel_display1(1);   //switch语句
#endif

#ifdef  choose_Systick		  
	  led_run_Systick(1000);//LED延时systick功能--1s	  
#endif	
#ifdef  choose_Button		
	key_pros();
#endif	
#ifdef  choose_PWM		  
	PWM_LED();
#endif	
#ifdef  choose_Printf
      printf("hello world\r\n");
	  delay_ms(1000);
	  printf("世界这么大，我想去看看！\r\n");
	  delay_ms(1000);
	  printf("int   is %d\r\n",age);
	  delay_ms(1000);
	  printf("float is %f\r\n",num);
	  delay_ms(1000);
	  
#endif	  
	  
  }


//  return 0;
}



